go-go-golems/esp32-s3-m5/0118-cores3-qrcode-scanner/sdkconfig.defaults
# ESP-62 CoreS3 + Module13.2 QRCode scanner — sdkconfig.defaults
# CoreS3 baseline. Quad PSRAM (NOT octal — that's PaperS3). USB Serial/JTAG console.

# Target
CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash + custom partitions (app > 1 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash: QIO 80 MHz (CoreS3)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8 MB Quad (CoreS3)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=6384

# CPU 160 MHz is sufficient for UART + LCD and reduces CoreS3 heat.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# USB Serial/JTAG console (AGENTS.md S3 rule)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_UART is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Main task stack (M5Unified + UI)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# 1000 Hz tick for honest ms timing
CONFIG_FREERTOS_HZ=1000

# Stable machine-readable logs
CONFIG_LOG_COLORS=n
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
